---
kind: property
id: P:Autodesk.Revit.DB.ThermalAsset.ThermalMaterialType
source: html/bd8af449-c7ef-7e95-a82e-eb6c5104cd5f.htm
---
# Autodesk.Revit.DB.ThermalAsset.ThermalMaterialType Property

The type of material that this thermal asset describes (e.g. solid, liquid, gas.)

## Syntax (C#)
```csharp
public ThermalMaterialType ThermalMaterialType { get; }
```